tieutuanbao/mcu_xlibs/arch/arm/geehy/apm32f003x4x6/libs/source/apm32f00x_tmr1.c
/*!
 * @file        apm32f00x_tmr1.c
 *
 * @brief       This file contains all the functions for the Timer1 peripheral
 *
 * @version     V1.0.1
 *
 * @date        2022-04-11
 *
 * @attention
 *
 *  Copyright (C) 2018-2022 Geehy Semiconductor
 *
 *  You may not use this file except in compliance with the
 *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
 *
 *  The program is only for reference, which is distributed in the hope
 *  that it will be usefull and instructional for customers to develop
 *  their software. Unless required by applicable law or agreed to in
 *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
 *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
 *  and limitations under the License.
 */
#include "apm32f00x_tmr1.h"

/** @addtogroup Peripherals_Library Standard Peripheral Library
  @{
*/

/** @addtogroup TMR1_Driver TMR1 Driver
  @{
*/

/** @addtogroup TMR1_Fuctions Fuctions
  @{
*/

/*!
 * @brief       Set the timer1 peripheral registers to their default reset values.
 *
 * @param       tmr:  timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      None
 *
 * @note
 */
void TMR1_Reset(TMR1_T *tmr)
{
    tmr->CTRL1 = TMR1_CTRL1_RESET_VALUE;
    tmr->CTRL2 = TMR1_CTRL2_RESET_VALUE;

    tmr->SMC = TMR1_SMC_RESET_VALUE;
    tmr->ETC = TMR1_ETC_RESET_VALUE;
    tmr->INTCTRL = TMR1_INTCTRL_RESET_VALUE;
    tmr->STS2 = TMR1_STS1_RESET_VALUE;

    /* Disable channels */
    tmr->CHCTRL1 = TMR1_CHCTRL1_RESET_VALUE;
    tmr->CHCTRL2 = TMR1_CHCTRL2_RESET_VALUE;

    /* Configure channels as inputs: it is necessary if lock level is equal to 2 or 3 */
    tmr->CH1CCM = 1;
    tmr->CH2CCM = 1;
    tmr->CH3CCM = 1;
    tmr->CH4CCM = 1;

    /* Then reset channel registers: it also works if lock level is equal to 2 or 3 */
    tmr->CHCTRL1 = TMR1_CHCTRL1_RESET_VALUE;
    tmr->CHCTRL2 = TMR1_CHCTRL2_RESET_VALUE;
    tmr->CH1CCM = TMR1_CH1CCM_RESET_VALUE;
    tmr->CH2CCM = TMR1_CH2CCM_RESET_VALUE;
    tmr->CH3CCM = TMR1_CH3CCM_RESET_VALUE;
    tmr->CH4CCM = TMR1_CH4CCM_RESET_VALUE;
    tmr->CNT1 = TMR1_CNT1_RESET_VALUE;
    tmr->CNT0 = TMR1_CNT0_RESET_VALUE;
    tmr->PSC1 = TMR1_DIV1_RESET_VALUE;
    tmr->PSC0 = TMR1_DIV0_RESET_VALUE;
    tmr->AUTORLD1 = TMR1_AUTORLD1_RESET_VALUE;
    tmr->AUTORLD0 = TMR1_AUTORLD0_RESET_VALUE;
    tmr->CH1CC1 = TMR1_CH1CC1_RESET_VALUE;
    tmr->CH1CC0 = TMR1_CH1CC0_RESET_VALUE;
    tmr->CH2CC1 = TMR1_CH2CC1_RESET_VALUE;
    tmr->CH2CC0 = TMR1_CH2CC0_RESET_VALUE;
    tmr->CH3CC1 = TMR1_CH3CC1_RESET_VALUE;
    tmr->CH3CC0 = TMR1_CH3CC0_RESET_VALUE;
    tmr->CH4CC1 = TMR1_CH4CC1_RESET_VALUE;
    tmr->CH4CC0 = TMR1_CH4CC0_RESET_VALUE;
    tmr->ISO = TMR1_ISO_RESET_VALUE;
    tmr->SCEG = 1;
    tmr->DTS = TMR1_DTS_RESET_VALUE;
    tmr->BRKCTRL = TMR1_BRKCTRL_RESET_VALUE;
    tmr->REPCNT = TMR1_REPCNT_RESET_VALUE;
    tmr->STS1 = TMR1_STS1_RESET_VALUE;

    if(tmr == TMR1A)
    {
        tmr->CHEN = TMR1_CHEN_RESET_VALUE;
    }
}

/*!
 * @brief       Initializes the Timer1 Time Base Unit according to the specified parameters
 *
 * @param       tmr:                    timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       timeBaseConfigStruct:   pointer to a TMR1_TimeBaseConfig_T structure that
 *                                      contains the configuration information for the
 *                                      specified Timer peripheral
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigTimerBase(TMR1_T *tmr, TMR1_TimeBaseConfig_T *timeBaseConfigStruct)
{
    /** Set the auto reload value */
    tmr->AUTORLD1 = (uint32_t)(timeBaseConfigStruct->count >> 8) & 0xff;
    tmr->AUTORLD0 = (uint32_t)timeBaseConfigStruct->count & 0xff;

    /** set divide number */
    tmr->PSC1 = (uint32_t)(timeBaseConfigStruct->divider >> 8) & 0xff;
    tmr->PSC0 = (uint32_t)timeBaseConfigStruct->divider & 0xff;

    /** set coute mode */
    tmr->CTRL1_B.CNTMODE = timeBaseConfigStruct->cntMode & 0X0F;
    /** set count direction */
    tmr->CTRL1_B.CNTDIR = (timeBaseConfigStruct->cntMode >> 4) & 0XF;

    /** set Repetition Counter */
    tmr->REPCNT = (uint32_t)timeBaseConfigStruct->repetitionCount;

    /** Generate an update event to reload the Prescaler and the divide counter values immediately */
    tmr->SCEG_B.UEG = BIT_SET;
}

/*!
 * @brief       Fills each timeBaseConfigStruct member with its default value
 *
 * @param       timeBaseConfigStruct:   Pointer to a TMR1_TimeBaseConfig_T structure which will be initialized
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigTimeBaseStructInit(TMR1_TimeBaseConfig_T *timeBaseConfigStruct)
{
    timeBaseConfigStruct->cntMode = TMR1_CNT_MODE_UP;
    timeBaseConfigStruct->divider = 0;
    timeBaseConfigStruct->count = 0xffff;
    timeBaseConfigStruct->repetitionCount = 0;
}

/*!
 * @brief       Enable timer channel
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       channel:    Timer Channel
 *                          The Parameter can be combination of the following values:
 *                          @arg TMR1_CHANNEL_1:    Channel 1
 *                          @arg TMR1_CHANNEL_2:    Channel 2
 *                          @arg TMR1_CHANNEL_3:    Channel 3
 *                          @arg TMR1_CHANNEL_4:    Channel 4
 *
 * @retval      None
 *
 * @note        Only TMR1A can Enable or Disable channel
 */
void TMR1_EnableChannel(TMR1_T *tmr, uint8_t channel)
{
    if(tmr == TMR1A)
    {
        tmr->CHEN |= channel;
    }
}

/*!
 * @brief       Disable timer channel
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       channel:    Timer Channel
 *                          The Parameter can be combination of the following values:
 *                          @arg TMR1_CHANNEL_1:    Channel 1
 *                          @arg TMR1_CHANNEL_2:    Channel 2
 *                          @arg TMR1_CHANNEL_3:    Channel 3
 *                          @arg TMR1_CHANNEL_4:    Channel 4
 *
 * @retval      None
 *
 * @note        Only TMR1A can Enable or Disable channel
 */
void TMR1_DisableChannel(TMR1_T *tmr, uint8_t channel)
{
    if(tmr == TMR1A)
    {
        tmr->CHEN &= (uint32_t)~channel;
    }
}

/*!
 * @brief       Initializes the TIMER1/TIMER1A Channel1 Output Compare according to the specified parameters
 *
 * @param       tmr:            Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       ocConfigStruct: pointer to a TMR1_OCConfig_T structure that
 *                              contains the configuration information for the specified Timer peripheral
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigOutputComare1(TMR1_T *tmr, TMR1_OCConfig_T * ocConfigStruct)
{
    /** OCx ploarity */
    tmr->CHCTRL1_B.CH1CCP = ocConfigStruct->OCxPolarity;
    /** OCxN ploarity */
    tmr->CHCTRL1_B.CH1OCNP = ocConfigStruct->OCxNPolarity;

    /** OCx output Enable/Disable */
    tmr->CHCTRL1_B.CH1CCEN = ocConfigStruct->OCxOutputState;
    /** OCxN output Enable/Disable */
    tmr->CHCTRL1_B.CH1OCNEN = ocConfigStruct->OCxNOutputState;

    /** compare mode */
    tmr->CH1OC_B.OCMS = ocConfigStruct->mode;

