tieutuanbao/mcu_xlibs/arch/arm/geehy/apm32f003x4x6/libs/source/apm32f00x_tmr1.c
    /** OCx idle state */
    tmr->ISO_B.CH1ISO = ocConfigStruct->OCxIdleState;
    /** OCxN idle state */
    tmr->ISO_B.CH1NISO = ocConfigStruct->OCxNIdleState;

    /** compare data */
    tmr->CH1CC1 = (uint32_t)(ocConfigStruct->count >> 8) & 0xff;
    tmr->CH1CC0 = (uint32_t)(ocConfigStruct->count) & 0xff;
}

/*!
 * @brief       Initializes the TIMER1/TIMER1A Channel2 Output Compare according to the specified parameters
 *
 * @param       tmr:            Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       ocConfigStruct: pointer to a TMR1_OCConfig_T structure that
 *                              contains the configuration information for the specified Timer peripheral
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigOutputComare2(TMR1_T *tmr, TMR1_OCConfig_T * ocConfigStruct)
{
    /** OCx ploarity */
    tmr->CHCTRL1_B.CH2CCP = ocConfigStruct->OCxPolarity;
    /** OCxN ploarity */
    tmr->CHCTRL1_B.CH2OCNP = ocConfigStruct->OCxNPolarity;

    /** OCx output Enable/Disable */
    tmr->CHCTRL1_B.CH2CCEN = ocConfigStruct->OCxOutputState;
    /** OCxN output Enable/Disable */
    tmr->CHCTRL1_B.CH2OCNEN = ocConfigStruct->OCxNOutputState;

    /** compare mode */
    tmr->CH2OC_B.OCMS = ocConfigStruct->mode;

    /** OCx idle state */
    tmr->ISO_B.CH2ISO = ocConfigStruct->OCxIdleState;
    /** OCxN idle state */
    tmr->ISO_B.CH2NISO = ocConfigStruct->OCxNIdleState;

    /** compare data */
    tmr->CH2CC1 = (uint32_t)(ocConfigStruct->count >> 8) & 0xff;
    tmr->CH2CC0 = (uint32_t)(ocConfigStruct->count) & 0xff;
}

/*!
 * @brief       Initializes the TIMER1/TIMER1A Channel3 Output Compare according to the specified parameters
 *
 * @param       tmr:            Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       ocConfigStruct: pointer to a TMR1_OCConfig_T structure that
 *                              contains the configuration information for the specified Timer peripheral
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigOutputComare3(TMR1_T *tmr, TMR1_OCConfig_T * ocConfigStruct)
{
    /** OCx ploarity */
    tmr->CHCTRL2_B.CH3CCP = ocConfigStruct->OCxPolarity;

    /** OCx output Enable/Disable */
    tmr->CHCTRL2_B.CH3CCEN = ocConfigStruct->OCxOutputState;

    /** compare mode */
    tmr->CH3OC_B.OCMS = ocConfigStruct->mode;

    /** OCx idle state */
    tmr->ISO_B.CH3ISO = ocConfigStruct->OCxIdleState;

    /** compare data */
    tmr->CH3CC1 = (uint32_t)(ocConfigStruct->count >> 8) & 0xff;
    tmr->CH3CC0 = (uint32_t)(ocConfigStruct->count) & 0xff;
}

/*!
 * @brief       Initializes the TIMER1/TIMER1A Channel4 Output Compare according to the specified parameters
 *
 * @param       tmr:                Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       ocConfigStruct:     pointer to a TMR1_OCConfig_T structure that
 *                                  contains the configuration information for the specified Timer peripheral
 *
 * @retval      None
 *
 * @see
 *
 * @note
 */
void TMR1_ConfigOutputComare4(TMR1_T *tmr, TMR1_OCConfig_T * ocConfigStruct)
{
    /** OCx ploarity */
    tmr->CHCTRL2_B.CH4CCP = ocConfigStruct->OCxPolarity;

    /** OCx output Enable/Disable */
    tmr->CHCTRL2_B.CH4CCEN = ocConfigStruct->OCxOutputState;

    /** compare mode */
    tmr->CH4OC_B.OCMS = ocConfigStruct->mode;

    /** OCx idle state */
    tmr->ISO_B.CH4ISO = ocConfigStruct->OCxIdleState;

    /** compare data */
    tmr->CH4CC1 = (uint32_t)(ocConfigStruct->count >> 8) & 0xff;
    tmr->CH4CC0 = (uint32_t)(ocConfigStruct->count) & 0xff;
}

/*!
 * @brief       Initializes the TIMER1/TIMER1A Output Compare according to the specified parameters
 *
 * @param       tmr:            Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       ocConfigStruct: pointer to a TMR1_OCConfig_T structure that
 *                              contains the configuration information for the specified Timer peripheral
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigOutputCompare(TMR1_T *tmr, TMR1_OCConfig_T * ocConfigStruct)
{
    TMR1_EnableChannel(tmr, ocConfigStruct->channel);

    if(ocConfigStruct->channel & TMR1_CHANNEL_1)
    {
        TMR1_ConfigOutputComare1(tmr, ocConfigStruct);
    }

    if(ocConfigStruct->channel & TMR1_CHANNEL_2)
    {
        TMR1_ConfigOutputComare2(tmr, ocConfigStruct);
    }

    if(ocConfigStruct->channel & TMR1_CHANNEL_3)
    {
        TMR1_ConfigOutputComare3(tmr, ocConfigStruct);
    }

    if(ocConfigStruct->channel & TMR1_CHANNEL_4)
    {
        TMR1_ConfigOutputComare4(tmr, ocConfigStruct);
    }
}

/*!
 * @brief       Fills each ocConfigStruct member with its default value
 *
 * @param       ocConfigStruct: Pointer to a TMR1_OCConfig_T structure which will be initialized
 *
 * @retval      None
 *
 * @note
 */
void TMR1_OCStructInit(TMR1_OCConfig_T *ocConfigStruct)
{
    ocConfigStruct->channel = TMR1_CHANNEL_1;
    ocConfigStruct->count = 0xffff;
    ocConfigStruct->mode = TMR1_OC_MODE_TIMING;
    ocConfigStruct->OCxIdleState = TMR1_OC_IDLE_RESET;
    ocConfigStruct->OCxNIdleState = TMR1_OC_IDLE_RESET;
    ocConfigStruct->OCxNOutputState = TMR1_OC_OUTPUT_DISABLE;
    ocConfigStruct->OCxOutputState = TMR1_OC_OUTPUT_DISABLE;
    ocConfigStruct->OCxNPolarity = TMR1_OC_POLARITY_HIGH;
    ocConfigStruct->OCxPolarity = TMR1_OC_POLARITY_HIGH;
}

/*!
 * @brief       Output compare mode configuration
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       channel:    Timer channel.
 *                          This parameter can be any combination of the following values:
 *                          @arg TMR1_CHANNEL_1: Channel 1
 *                          @arg TMR1_CHANNEL_2: Channel 2
 *                          @arg TMR1_CHANNEL_3: Channel 3
 *                          @arg TMR1_CHANNEL_4: Channel 4
 *
 * @param       mode:       Output compare mode.
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigOutputCompareMode(TMR1_T * tmr, uint8_t channel, TMR1_OC_MODE_T mode)
{
    if(channel & TMR1_CHANNEL_1)
    {
        tmr->CH1OC_B.OCMS = mode;
    }

    if(channel & TMR1_CHANNEL_2)
    {
        tmr->CH2OC_B.OCMS = mode;
    }

    if(channel & TMR1_CHANNEL_3)
    {
        tmr->CH3OC_B.OCMS = mode;
    }

