tieutuanbao/mcu_xlibs/arch/arm/geehy/apm32f003x4x6/libs/source/apm32f00x_tmr1.c
    if(channel & TMR1_CHANNEL_4)
    {
        tmr->CH4OC_B.OCMS = mode;
    }
}

/*!
 * @brief        Initializes the TMR1/TMR1A Channel 1 Input Capture according to the specified parameters
 *
 * @param        tmr:       Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param        polarity:  Input capture polarity.
 *
 * @param        selection: Input capture source selection.
 *
 * @param        div:       Input capture divider number.
 *
 * @param        filter:    Input capture filter.
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigInputCapture1(TMR1_T *tmr, TMR1_IC_POLARITY_T polarity, TMR1_IC_SELECT_T selection,
                                        TMR1_IC_DIV_T div, uint8_t filter)
{
    /** input capture selection */
    tmr->CH1IC_B.MODESEL = selection;

    /** filter set */
    tmr->CH1IC_B.ICFC = filter & 0X0F;

    /** input capture divider */
    tmr->CH1IC_B.IC1PSC = div;

    /** input polarity */
    tmr->CHCTRL1_B.CH1CCP = polarity;

    /** Enable input */
    tmr->CHCTRL1_B.CH1CCEN = BIT_SET;
}

/*!
 * @brief       Initializes the TMR1/TMR1A Channel 2 Input Capture according to the specified parameters
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       polarity:   Input capture polarity.
 *
 * @param       selection:  Input capture source selection.
 *
 * @param       div:        Input capture divider number.
 *
 * @param       filter:     Input capture filter.
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigInputCapture2(TMR1_T *tmr, TMR1_IC_POLARITY_T polarity, TMR1_IC_SELECT_T selection,
                                        TMR1_IC_DIV_T div, uint8_t filter)
{
    /** input capture selection */
    tmr->CH2IC_B.MODESEL = selection;

    /** filter set */
    tmr->CH2IC_B.ICFC = filter;

    /** input capture divider */
    tmr->CH2IC_B.IC2PSC = div;

    /** input polarity */
    tmr->CHCTRL1_B.CH2CCP = polarity;

    /** Enable input */
    tmr->CHCTRL1_B.CH2CCEN = BIT_SET;
}

/*!
 * @brief       Initializes the TMR1/TMR1A Channel 3 Input Capture according to the specified parameters
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       polarity:   Input capture polarity.
 *
 * @param       selection:  Input capture source selection.
 *
 * @param       div:        Input capture divider number.
 *
 * @param       filter:     Input capture filter.
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigInputCapture3(TMR1_T *tmr, TMR1_IC_POLARITY_T polarity, TMR1_IC_SELECT_T selection,
                                        TMR1_IC_DIV_T div, uint8_t filter)
{
    /** input capture selection */
    tmr->CH3IC_B.MODESEL = selection;

    /** filter set */
    tmr->CH3IC_B.ICFC = filter;

    /** input capture divider */
    tmr->CH3IC_B.IC3PSC = div;

    /** input polarity */
    tmr->CHCTRL2_B.CH3CCP = polarity;

    /** Enable input */
    tmr->CHCTRL2_B.CH3CCEN = BIT_SET;
}

/*!
 * @brief       Initializes the TMR1/TMR1A Channel 4 Input Capture according to the specified parameters
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       polarity:   Input capture polarity.
 *
 * @param       selection:  Input capture source selection.
 *
 * @param       div:        Input capture divider number.
 *
 * @param       filter:     Input capture filter.
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigInputCapture4(TMR1_T *tmr, TMR1_IC_POLARITY_T polarity, TMR1_IC_SELECT_T selection,
                                        TMR1_IC_DIV_T div, uint8_t filter)
{
    /** input capture selection */
    tmr->CH4IC_B.MODESEL = selection;

    /** filter set */
    tmr->CH4IC_B.ICFC = filter;

    /** input capture divider */
    tmr->CH4IC_B.IC4PSC = div;

    /** input polarity */
    tmr->CHCTRL2_B.CH4CCP = polarity;

    /** Enable input */
    tmr->CHCTRL2_B.CH4CCEN = BIT_SET;
}

/*!
 * @brief       Initializes the TMR1/TMR1A  peripheral according to the specified parameters
 *
 * @param       tmr:            Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       icConfigStruct: pointer to a TMR1_ICConfig_T structure that
 *                              contains the configuration information for the specified Timer peripheral
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigInputCapture(TMR1_T *tmr, TMR1_ICConfig_T *icConfigStruct)
{
    TMR1_EnableChannel(tmr, icConfigStruct->channel);

    if(icConfigStruct->channel & TMR1_CHANNEL_1)
    {
        TMR1_ConfigInputCapture1(tmr, icConfigStruct->polarity, icConfigStruct->selection,
                                icConfigStruct->div, icConfigStruct->filter);
    }

    if(icConfigStruct->channel & TMR1_CHANNEL_2)
    {
        TMR1_ConfigInputCapture2(tmr, icConfigStruct->polarity, icConfigStruct->selection,
                                icConfigStruct->div, icConfigStruct->filter);
    }

    if(icConfigStruct->channel & TMR1_CHANNEL_3)
    {
        TMR1_ConfigInputCapture3(tmr, icConfigStruct->polarity, icConfigStruct->selection,
                                icConfigStruct->div, icConfigStruct->filter);
    }

    if(icConfigStruct->channel & TMR1_CHANNEL_4)
    {
        TMR1_ConfigInputCapture4(tmr, icConfigStruct->polarity, icConfigStruct->selection,
                                icConfigStruct->div, icConfigStruct->filter);
    }
}

/*!
 * @brief       Fills each icConfigStruct member with its default value
 *
 * @param       icConfigStruct: Pointer to a TMR1_ICConfig_T structure which will be initialized
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ICStructInit(TMR1_ICConfig_T *icConfigStruct)
{
    icConfigStruct->channel = TMR1_CHANNEL_1;
    icConfigStruct->div = TMR1_IC_DIV_1;
    icConfigStruct->filter = 0;
    icConfigStruct->polarity = TMR1_IC_POLARITY_RISING;
    icConfigStruct->selection = TMR1_IC_SELECT_DIRECTTI;
}

/*!
 * @brief       Dead time setting
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       deadTime:   dead time value
 *
 * @retval      None
 *
 * @note
 */
void TMR1_SetDeadTime(TMR1_T *tmr, uint8_t deadTime)
{
    tmr->DTS = (uint32_t)deadTime;
}

/*!
 * @brief       Configuration protection level
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       level:  protection level
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigProtectionLevel(TMR1_T *tmr, TMR1_PROTECTION_LEVEL_T level)
{
    tmr->BRKCTRL_B.PROTCFG = level;
}

/*!
 * @brief       Off-state in run mode selection
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       state:  Off-state Specified
 *
 * @retval      None
 *
 * @note
 */
void TMR1_SelectOffStateInRunMode(TMR1_T *tmr, TMR1_OSRM_T state)
{
    tmr->BRKCTRL_B.RMOS = state;
}

/*!
 * @brief       Off-state in idle mode selection
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       state:  Off-state Specified
 *
 * @retval      None
 *
 * @note
 */
void TMR1_SelectOffStateInIdleMode(TMR1_T *tmr, TMR1_OSIM_T state)
{
    tmr->BRKCTRL_B.IMOS = state;
}

/*!
 * @brief       Break polarity configuration
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       polarity:   Break polarity
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigBreakPolarity(TMR1_T *tmr, TMR1_BREAK_POL_T polarity)
{
    tmr->BRKCTRL_B.BRKPOL = polarity;
}

/*!
 * @brief       Enable break
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      None
 *
 * @note
 */
void TMR1_EnableBreak(TMR1_T *tmr)
{
    tmr->BRKCTRL_B.BRKEN = BIT_SET;
}

/*!
 * @brief       Disable break
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      None
 *
 * @note
 */
void TMR1_DisableBreak(TMR1_T *tmr)
{
    tmr->BRKCTRL_B.BRKEN = BIT_RESET;
}

/*!
 * @brief       Enable Automatic Output
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      None
 *
 * @note
 */
void TMR1_EnableAutomaticOutput(TMR1_T *tmr)
{
    tmr->BRKCTRL_B.AOEN = BIT_SET;
}

/*!
 * @brief       Disable Automatic Output
 *
 * @param       tmr:   Timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      None
 *
 * @note
 */
void TMR1_DisableAutomaticOutput(TMR1_T *tmr)
{
    tmr->BRKCTRL_B.AOEN = BIT_RESET;
}

/*!
 * @brief       Configures the TIM1 peripheral PWM Input Mode according to the specified parameters
 *
 * @param       tmr:            Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       pwmInputConfig: pointer to a TMR1_ICConfig_T structure that
 *                              contains the configuration information for the specified Timer peripheral
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigInputPWM(TMR1_T *tmr, TMR1_ICConfig_T *pwmInputConfig)
{
    TMR1_IC_POLARITY_T polarityCHxN = TMR1_IC_POLARITY_RISING;
    TMR1_IC_SELECT_T selectionCHxN = TMR1_IC_SELECT_DIRECTTI;

    if(pwmInputConfig->polarity == TMR1_IC_POLARITY_RISING)
    {
        polarityCHxN = TMR1_IC_POLARITY_FALLING;
    }

    if(pwmInputConfig->selection == TMR1_IC_SELECT_DIRECTTI)
    {
        selectionCHxN = TMR1_IC_SELECT_INDIRECTTI;
    }

    if(pwmInputConfig->channel == TMR1_CHANNEL_1)
    {
        TMR1_ConfigInputCapture1(tmr, pwmInputConfig->polarity, pwmInputConfig->selection,
                                pwmInputConfig->div, pwmInputConfig->filter);

