tieutuanbao/mcu_xlibs/arch/arm/geehy/apm32f003x4x6/libs/source/apm32f00x_tmr1.c
        TMR1_ConfigInputCapture2(tmr, polarityCHxN, selectionCHxN,
                                pwmInputConfig->div, pwmInputConfig->filter);
    }
    else if(pwmInputConfig->channel == TMR1_CHANNEL_2)
    {
        TMR1_ConfigInputCapture2(tmr, pwmInputConfig->polarity, pwmInputConfig->selection,
                                pwmInputConfig->div, pwmInputConfig->filter);

        TMR1_ConfigInputCapture1(tmr, polarityCHxN, selectionCHxN,
                                pwmInputConfig->div, pwmInputConfig->filter);
    }

    TMR1_EnableChannel(tmr, TMR1_CHANNEL_1 | TMR1_CHANNEL_2);
}

/*!
 * @brief       Enable Timer1 or Timer1A
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      None
 *
 * @note
 */
void TMR1_Enable(TMR1_T *tmr)
{
    tmr->CTRL1_B.CNTEN = BIT_SET;
}

/*!
 * @brief       Disable Timer1 or Timer1A
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      None
 *
 * @note
 */
void TMR1_Disable(TMR1_T *tmr)
{
    tmr->CTRL1_B.CNTEN = BIT_RESET;
}

/*!
 * @brief       Enable Specifies timer PWM output(whole output)
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      None
 *
 * @note
 */
void TMR1_EnableOutputPWM(TMR1_T *tmr)
{
    tmr->BRKCTRL_B.WOEN = BIT_SET;
}

/*!
 * @brief       Disable Specifies timer PWM output(main output)
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      None
 *
 * @note
 */
void TMR1_DisableOutputPWM(TMR1_T *tmr)
{
    tmr->BRKCTRL_B.WOEN = BIT_RESET;
}

/*!
 * @brief       Enable interrupt
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       interrupt:  Interrupt source.
 *                          This parameter can be any combination of the following values:
 *                          @arg TMR1_INT_UPDATE:   Update interrupt
 *                          @arg TMR1_INT_CH1CC:    Channel 1 Compare/Capture interrupt
 *                          @arg TMR1_INT_CH2CC:    Channel 2 Compare/Capture interrupt
 *                          @arg TMR1_INT_CH3CC:    Channel 3 Compare/Capture interrupt
 *                          @arg TMR1_INT_CH4CC:    Channel 4 Compare/Capture interrupt
 *                          @arg TMR1_INT_CC_UPDATE:Compare/Capture Update interrupt
 *                          @arg TMR1_INT_TRIGGER:  Trigger interrupt
 *                          @arg TMR1_INT_BREAK:    Break interrupt
 * @retval      None
 *
 * @note
 */
void TMR1_EnableInterrupt(TMR1_T *tmr, uint8_t interrupt)
{
    tmr->INTCTRL |= (uint32_t)interrupt;
}

/*!
 * @brief        Disable interrupt
 *
 * @param        tmr:       Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param        interrupt: Interrupt source.
 *                          This parameter can be any combination of the following values:
 *                          @arg TMR1_INT_UPDATE:   Update interrupt
 *                          @arg TMR1_INT_CH1CC:    Channel 1 Compare/Capture interrupt
 *                          @arg TMR1_INT_CH2CC:    Channel 2 Compare/Capture interrupt
 *                          @arg TMR1_INT_CH3CC:    Channel 3 Compare/Capture interrupt
 *                          @arg TMR1_INT_CH4CC:    Channel 4 Compare/Capture interrupt
 *                          @arg TMR1_INT_CC_UPDATE:Compare/Capture Update interrupt
 *                          @arg TMR1_INT_TRIGGER:  Trigger interrupt
 *                          @arg TMR1_INT_BREAK:    Break interrupt
 *
 * @retval        None
 *
 * @note
 */
void TMR1_DisableInterrupt(TMR1_T *tmr, uint8_t interrupt)
{
    tmr->INTCTRL &= (uint32_t)~interrupt;
}

/*!
 * @brief       External trigger configuration
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       polarity:   External Trigger polarity.
 *
 * @param       div:        External Trigger divider number.
 *
 * @param       filter:     External Trigger filter
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigExternalTrigger(TMR1_T *tmr, TMR1_EXT_TRG_POLARITY_T polarity,
                                        TMR1_ETRG_DIV_T div, uint8_t filter)
{
    tmr->ETC_B.ETFC = filter & 0X0F;

    tmr->ETC_B.ETRC = div;

    tmr->ETC_B.ETPC = polarity;
}

/*!
 * @brief       External Clock mode 2 Enable
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       polarity:   External Trigger polarity.
 *
 * @param       div:        External Trigger divider number.
 *
 * @param       filter:     External Trigger filter
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigExternalClockMode2(TMR1_T *tmr, TMR1_EXT_TRG_POLARITY_T polarity,
                                            TMR1_ETRG_DIV_T div, uint8_t filter)
{
    TMR1_ConfigExternalTrigger(tmr, polarity, div, filter);

    tmr->ETC_B.ECM2EN = BIT_SET;
}

/*!
 * @brief       External Clock mode 1 Enable
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       clock:      External clock source.
 *
 * @param       polarity:   Clock Polarity
 *
 * @param       filter:     Clock filter
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigExternalClockMode1(TMR1_T *tmr, TMR1_EXT_CLK_SOURCE_T clock,
                                            TMR1_IC_POLARITY_T polarity, uint8_t filter)
{
    if(clock == TMR1_EXT_CLK_SOURCE_CH2INFP2)
    {
        TMR1_ConfigInputCapture2(tmr, polarity, TMR1_IC_SELECT_DIRECTTI, TMR1_IC_DIV_1, filter);
    }
    else
    {
        TMR1_ConfigInputCapture1(tmr, polarity, TMR1_IC_SELECT_DIRECTTI, TMR1_IC_DIV_1, filter);
    }

    tmr->SMC_B.ITC = clock;

    tmr->SMC_B.SMFC = TMR1_SLAVE_MODE_EXTERNAL1;
}

/*!
 * @brief       Counter mode configuration
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       mode:   Counter mode
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigCountMode(TMR1_T *tmr, TMR1_CNT_MODE_T mode)
{
    tmr->CTRL1_B.CNTDIR = (mode >> 4) & 0x01;
    tmr->CTRL1_B.CNTMODE = mode & 0X03;
}

/*!
 * @brief       Set divider
 *
 * @param       tmr:       Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       divider:   divider
 *
 * @retval      None
 *
 * @note
 */
void TMR1_SetDivider(TMR1_T *tmr, uint16_t divider)
{
    tmr->PSC1 = (uint32_t)((divider >> 8) & 0xff);

    tmr->PSC0 = (uint32_t)(divider & 0xff);
}

/*!
 * @brief       Enable Single pulse mode
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      None
 *
 * @note
 */
void TMR1_EnableSinglePulseMode(TMR1_T *tmr)
{
    tmr->CTRL1_B.SPMEN = BIT_SET;
}

/*!
 * @brief       Disable Single pulse mode
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      None
 *
 * @note
 */
void TMR1_DisableSinglePulseMode(TMR1_T *tmr)
{
    tmr->CTRL1_B.SPMEN = BIT_RESET;
}

/*!
 * @brief       Update source configuration
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       source: Specifies the update source.
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigUpdate(TMR1_T *tmr, TMR1_UPDATE_SOURCE_T source)
{
    tmr->CTRL1_B.UES = source & 0x01;
    tmr->CTRL1_B.NGUE = (source >> 4) & 0x01;
}

/*!
 * @brief       Input Trigger Configuration
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       trigger:    Input Trigger selection
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigInputTrigger(TMR1_T *tmr, TMR1_ITC_T trigger)
{
    tmr->SMC_B.ITC = trigger;
}

/*!
 * @brief       Encoder Interface configuraion
 *
 * @param       tmr:                    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       encoderConfigStruct:    pointer to a TMR1_EncoderConfig_T structure that
 *                                      contains the configuration information
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigEncodeInterface(TMR1_T *tmr, TMR1_EncoderConfig_T *encoderConfigStruct)
{
    tmr->SMC_B.SMFC = encoderConfigStruct->mode;

    tmr->CH1IC_B.MODESEL = TMR1_IC_SELECT_DIRECTTI;

    tmr->CH2IC_B.MODESEL = TMR1_IC_SELECT_DIRECTTI;

    tmr->CHCTRL1_B.CH1CCP = encoderConfigStruct->polarityIC1;

    tmr->CHCTRL1_B.CH2CCP = encoderConfigStruct->polarityIC2;
}

/*!
 * @brief       Compare/Capture update source configuration
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       mode:   Compare/Capture update source
 *                      This parameter can be one of following values:
 *                      @TMR1_CCUS_0:   Update by setting SCEG_CCUEG = 1
 *                      @TMR1_CCUS_1:   Update by setting SCEG_CCUEG = 1 or when an rising edge occurs on tirgger input.
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigCCUpdateSource(TMR1_T *tmr, TMR1_CCUS_T mode)
{
    tmr->CTRL2_B.CCUS = mode;
}

/*!
 * @brief       Enable Capture/Compare buffer(preloaded)
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      None
 *
 * @note
 */
void TMR1_EnableCompareCaptureBuffer(TMR1_T *tmr)
{
    tmr->CTRL2_B.CCBEN = BIT_SET;
}

/*!
 * @brief       Disable Capture/Compare buffer(preloaded)
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      None
 *
 * @note
 */
void TMR1_DisableCompareCaptureBuffer(TMR1_T *tmr)
{
    tmr->CTRL2_B.CCBEN = BIT_RESET;
}

/*!
 * @brief       Enable Auto-reload buffer(preloaded)
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      None
 *
 * @note
 */
void TMR1_EnableAutoReloadBuffer(TMR1_T *tmr)
{
    tmr->CTRL1_B.ARBEN = BIT_SET;
}

/*!
 * @brief       Disable Auto-reload buffer(preloaded)
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      None
 *
 * @note
 */
void TMR1_DisableAutoReloadBuffer(TMR1_T *tmr)
{
    tmr->CTRL1_B.ARBEN = BIT_RESET;
}

/*!
 * @brief       Enable Specified Channel output compare buffer(preload)
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       channel:    Timer Channel
 *                          The Parameter can be combination of the following values:
 *                          @arg TMR1_CHANNEL_1:    Channel 1
 *                          @arg TMR1_CHANNEL_2:    Channel 2
 *                          @arg TMR1_CHANNEL_3:    Channel 3
 *                          @arg TMR1_CHANNEL_4:    Channel 4
 *
 * @retval      None
 *
 * @note
 */
void TMR1_EnableOutputCompareBuffer(TMR1_T *tmr, uint8_t channel)
{
    if(channel & TMR1_CHANNEL_1)
    {
        tmr->CH1OC_B.OCBEN = BIT_SET;
    }

    if(channel & TMR1_CHANNEL_2)
    {
        tmr->CH2OC_B.OCBEN = BIT_SET;
    }

    if(channel & TMR1_CHANNEL_3)
    {
        tmr->CH3OC_B.OCBEN = BIT_SET;
    }

