tieutuanbao/mcu_xlibs/arch/arm/geehy/apm32f003x4x6/libs/source/apm32f00x_tmr1.c
    if(channel & TMR1_CHANNEL_4)
    {
        tmr->CH4OC_B.OCBEN = BIT_SET;
    }
}

/*!
 * @brief       Disable Specified Channel output compare buffer(preload)
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       channel:    Timer Channel
 *                          The Parameter can be combination of the following values:
 *                          @arg TMR1_CHANNEL_1:    Channel 1
 *                          @arg TMR1_CHANNEL_2:    Channel 2
 *                          @arg TMR1_CHANNEL_3:    Channel 3
 *                          @arg TMR1_CHANNEL_4:    Channel 4
 *
 * @retval      None
 *
 * @note
 */
void TMR1_DisableOutputCompareBuffer(TMR1_T *tmr, uint8_t channel)
{
    if(channel & TMR1_CHANNEL_1)
    {
        tmr->CH1OC_B.OCBEN = BIT_RESET;
    }

    if(channel & TMR1_CHANNEL_2)
    {
        tmr->CH2OC_B.OCBEN = BIT_RESET;
    }

    if(channel & TMR1_CHANNEL_3)
    {
        tmr->CH3OC_B.OCBEN = BIT_RESET;
    }

    if(channel & TMR1_CHANNEL_4)
    {
        tmr->CH4OC_B.OCBEN = BIT_RESET;
    }
}

/*!
 * @brief       Enable Specified Channel output compare fast mode
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       channel:    Timer Channel
 *                          The Parameter can be combination of the following values:
 *                          @arg TMR1_CHANNEL_1:    Channel 1
 *                          @arg TMR1_CHANNEL_2:    Channel 2
 *                          @arg TMR1_CHANNEL_3:    Channel 3
 *                          @arg TMR1_CHANNEL_4:    Channel 4
 *
 * @retval      None
 *
 * @note
 */
void TMR1_EnableOutputCompareFastMode(TMR1_T *tmr, uint8_t channel)
{
    if(channel & TMR1_CHANNEL_1)
    {
        tmr->CH1OC_B.OCFEN = BIT_SET;
    }

    if(channel & TMR1_CHANNEL_2)
    {
        tmr->CH2OC_B.OCFEN = BIT_SET;
    }

    if(channel & TMR1_CHANNEL_3)
    {
        tmr->CH3OC_B.OCFEN = BIT_SET;
    }

    if(channel & TMR1_CHANNEL_4)
    {
        tmr->CH4OC_B.OCFEN = BIT_SET;
    }
}

/*!
 * @brief       Disable Specified Channel output compare fast mode
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       channel:    Timer Channel
 *                          The Parameter can be combination of the following values:
 *                          @arg TMR1_CHANNEL_1:    Channel 1
 *                          @arg TMR1_CHANNEL_2:    Channel 2
 *                          @arg TMR1_CHANNEL_3:    Channel 3
 *                          @arg TMR1_CHANNEL_4:    Channel 4
 *
 * @retval      None
 *
 * @note
 */
void TMR1_DisableOutputCompareFastMode(TMR1_T *tmr, uint8_t channel)
{
    if(channel & TMR1_CHANNEL_1)
    {
        tmr->CH1OC_B.OCFEN = BIT_RESET;
    }

    if(channel & TMR1_CHANNEL_2)
    {
        tmr->CH2OC_B.OCFEN = BIT_RESET;
    }

    if(channel & TMR1_CHANNEL_3)
    {
        tmr->CH3OC_B.OCFEN = BIT_RESET;
    }

    if(channel & TMR1_CHANNEL_4)
    {
        tmr->CH4OC_B.OCFEN = BIT_RESET;
    }
}

/*!
 * @brief       Generating Event by software
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       event:  Event source specified
 *              This parameter can be any combination of the following values:
 *              @arg TMR1_EVENT_UPDATE:     Update evnet
 *              @arg TMR1_EVENT_CH1CC:      Channel 1 Compare/Capture evnet
 *              @arg TMR1_EVENT_CH2CC:      Channel 2 Compare/Capture evnet
 *              @arg TMR1_EVENT_CH3CC:      Channel 3 Compare/Capture evnet
 *              @arg TMR1_EVENT_CH4CC:      Channel 4 Compare/Capture evnet
 *              @arg TMR1_EVENT_CC_UPDATE:  Compare/Capture Update evnet
 *              @arg TMR1_EVENT_TRIGGER:    Trigger evnet
 *              @arg TMR1_EVENT_BREAK:      Break evnet
 *
 * @retval      None
 *
 * @note
 */
void TMR1_GenerateEvent(TMR1_T *tmr, uint8_t event)
{
    tmr->SCEG = (uint32_t)event;
}

/*!
 * @brief       Specified Channel output compare polarity configuration
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       channel:    Timer Channel
 *                          The Parameter can be combination of the following values:
 *                          @arg TMR1_CHANNEL_1:    Channel 1
 *                          @arg TMR1_CHANNEL_2:    Channel 2
 *                          @arg TMR1_CHANNEL_3:    Channel 3
 *                          @arg TMR1_CHANNEL_4:    Channel 4
 *
 * @param       polarity:   Specifies the polarity
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigOutputComparePolarity(TMR1_T *tmr, uint8_t channel, TMR1_OC_POLARITY_T polarity)
{
    if(channel & TMR1_CHANNEL_1)
    {
        tmr->CHCTRL1_B.CH1CCP = polarity;
    }

    if(channel & TMR1_CHANNEL_2)
    {
        tmr->CHCTRL1_B.CH2CCP = polarity;
    }

    if(channel & TMR1_CHANNEL_3)
    {
        tmr->CHCTRL2_B.CH3CCP = polarity;
    }

    if(channel & TMR1_CHANNEL_4)
    {
        tmr->CHCTRL2_B.CH4CCP = polarity;
    }
}

/*!
 * @brief       Specified Channel output compare complementary polarity configuration
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A

 * @param       channel:    Timer Channel
 *                          The Parameter can be combination of the following values:
 *                          @arg TMR1_CHANNEL_1:    Channel 1
 *                          @arg TMR1_CHANNEL_2:    Channel 2
 *
 * @param       polarity:   Specifies the polarity
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigOutputCompareComplementPolarity(TMR1_T *tmr, uint8_t channel, TMR1_OC_POLARITY_T polarity)
{
    if(channel & TMR1_CHANNEL_1)
    {
        tmr->CHCTRL1_B.CH1OCNP = polarity;
    }

    if(channel & TMR1_CHANNEL_2)
    {
        tmr->CHCTRL1_B.CH2OCNP = polarity;
    }

}

/*!
 * @brief       Enable specified Channel Compare/Capture output
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       channel:    Timer Channel
 *                          The Parameter can be combination of the following values:
 *                          @arg TMR1_CHANNEL_1:    Channel 1
 *                          @arg TMR1_CHANNEL_2:    Channel 2
 *                          @arg TMR1_CHANNEL_3:    Channel 3
 *                          @arg TMR1_CHANNEL_4:    Channel 4
 *
 * @retval      None
 *
 * @note
 */
void TMR1_EnableCompareCapture(TMR1_T *tmr, uint8_t channel)
{
    if(channel & TMR1_CHANNEL_1)
    {
        tmr->CHCTRL1_B.CH1CCEN = BIT_SET;
    }

    if(channel & TMR1_CHANNEL_2)
    {
        tmr->CHCTRL1_B.CH2CCEN = BIT_SET;
    }

    if(channel & TMR1_CHANNEL_3)
    {
        tmr->CHCTRL2_B.CH3CCEN = BIT_SET;
    }

