tieutuanbao/mcu_xlibs/arch/arm/geehy/apm32f003x4x6/libs/source/apm32f00x_tmr1.c
    if(channel & TMR1_CHANNEL_4)
    {
        tmr->CHCTRL2_B.CH4CCEN = BIT_SET;
    }
}

/*!
 * @brief       Disable specified Channel Compare/Capture output
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       channel:    Timer Channel
 *                          The Parameter can be combination of the following values:
 *                          @arg TMR1_CHANNEL_1:    Channel 1
 *                          @arg TMR1_CHANNEL_2:    Channel 2
 *                          @arg TMR1_CHANNEL_3:    Channel 3
 *                          @arg TMR1_CHANNEL_4:    Channel 4
 *
 * @retval      None
 *
 * @note
 */
void TMR1_DisableCompareCapture(TMR1_T *tmr, uint8_t channel)
{
    if(channel & TMR1_CHANNEL_1)
    {
        tmr->CHCTRL1_B.CH1CCEN = BIT_RESET;
    }

    if(channel & TMR1_CHANNEL_2)
    {
        tmr->CHCTRL1_B.CH2CCEN = BIT_RESET;
    }

    if(channel & TMR1_CHANNEL_3)
    {
        tmr->CHCTRL2_B.CH3CCEN = BIT_RESET;
    }

    if(channel & TMR1_CHANNEL_4)
    {
        tmr->CHCTRL2_B.CH4CCEN = BIT_RESET;
    }
}

/*!
 * @brief       Enable specified Channel Compare/Capture complementary output
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       channel:    Timer Channel
 *                          The Parameter can be combination of the following values:
 *                          @arg TMR1_CHANNEL_1:    Channel 1
 *                          @arg TMR1_CHANNEL_2:    Channel 2
 *
 * @retval      None
 *
 * @note
 */
void TMR1_EnableCompareCaptureComplement(TMR1_T *tmr, uint8_t channel)
{
    if(channel & TMR1_CHANNEL_1)
    {
        tmr->CHCTRL1_B.CH1OCNEN = BIT_SET;
    }

    if(channel & TMR1_CHANNEL_2)
    {
        tmr->CHCTRL1_B.CH2OCNEN = BIT_SET;
    }
}

/*!
 * @brief       Disable specified Channel Compare/Capture complementary output
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       channel:    Timer Channel
 *                          The Parameter can be combination of the following values:
 *                          @arg TMR1_CHANNEL_1:    Channel 1
 *                          @arg TMR1_CHANNEL_2:    Channel 2
 *
 * @retval      None
 *
 * @note
 */
void TMR1_DisableCompareCaptureComplement(TMR1_T *tmr, uint8_t channel)
{
    if(channel & TMR1_CHANNEL_1)
    {
        tmr->CHCTRL1_B.CH1OCNEN = BIT_RESET;
    }

    if(channel & TMR1_CHANNEL_2)
    {
        tmr->CHCTRL1_B.CH2OCNEN = BIT_RESET;
    }
}

/*!
 * @brief       Set counter register value
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       count:  specifies the counter register new value
 *
 * @retval      None
 *
 * @note
 */
void TMR1_SetCounter(TMR1_T *tmr, uint16_t count)
{
    tmr->CNT1 = (uint32_t)((count >> 8) & 0xff);
    tmr->CNT0 = (uint32_t)(count & 0xff);
}

/*!
 * @brief       Set Auto-Reload register value
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       reload: specifies the Auto-Reload register new value
 *
 * @retval      None
 *
 * @note
 */
void TMR1_SetAutoReloadVaue(TMR1_T *tmr, uint16_t reload)
{
    tmr->AUTORLD1 = (uint32_t)((reload >> 8) & 0xff);
    tmr->AUTORLD0 = (uint32_t)(reload & 0xff);
}

/*!
 * @brief       Set specified Channel Compare/Capture register value
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       channel:    Timer Channel
 *                          The Parameter can be combination of the following values:
 *                          @arg TMR1_CHANNEL_1:    Channel 1
 *                          @arg TMR1_CHANNEL_2:    Channel 2
 *                          @arg TMR1_CHANNEL_3:    Channel 3
 *                          @arg TMR1_CHANNEL_4:    Channel 4
 *
 * @param       compare:    specifies the Channel Capture Compare register value
 *
 * @retval      None
 *
 * @note
 */
void TMR1_SetCompareCapture(TMR1_T *tmr, uint8_t channel, uint16_t compare)
{
    if(channel & TMR1_CHANNEL_1)
    {
        tmr->CH1CC1 = (uint32_t)((compare >> 8) & 0xff);
        tmr->CH1CC0 = (uint32_t)(compare & 0xff);
    }

    if(channel & TMR1_CHANNEL_2)
    {
        tmr->CH2CC1 = (uint32_t)((compare >> 8) & 0xff);
        tmr->CH2CC0 = (uint32_t)(compare & 0xff);
    }

    if(channel & TMR1_CHANNEL_3)
    {
        tmr->CH3CC1 = (uint32_t)((compare >> 8) & 0xff);
        tmr->CH3CC0 = (uint32_t)(compare & 0xff);
    }

    if(channel & TMR1_CHANNEL_4)
    {
        tmr->CH4CC1 = (uint32_t)((compare >> 8) & 0xff);
        tmr->CH4CC0 = (uint32_t)(compare & 0xff);
    }
}

/*!
 * @brief       Read Channel 1 Capture Compare register value
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      Channel 1 Capture Compare register value
 *
 * @note
 */
uint16_t TMR1_ReadCapture1(TMR1_T *tmr)
{
    uint16_t capture = 0;

    capture = (uint16_t)tmr->CH1CC1;
    capture <<= 8;
    capture |= (uint16_t)tmr->CH1CC0;

    return capture;
}

/*!
 * @brief       Read Channel 2 Capture Compare register value
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      Channel 2 Capture Compare register value
 *
 * @note
 */
uint16_t TMR1_ReadCapture2(TMR1_T *tmr)
{
    uint16_t capture = 0;

    capture = (uint16_t)tmr->CH2CC1;
    capture <<= 8;
    capture |= (uint16_t)tmr->CH2CC0;

    return capture;
}

/*!
 * @brief       Read Channel 3 Capture Compare register value
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      Channel 3 Capture Compare register value
 *
 * @note
 */
uint16_t TMR1_ReadCapture3(TMR1_T *tmr)
{
    uint16_t capture = 0;

    capture = (uint16_t)tmr->CH3CC1;
    capture <<= 8;
    capture |= (uint16_t)tmr->CH3CC0;

    return capture;
}

/*!
 * @brief       Read Channel 4 Capture Compare register value
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      Channel 4 Capture Compare register value
 *
 * @note
 */
uint16_t TMR1_ReadCapture4(TMR1_T *tmr)
{
    uint16_t capture = 0;

    capture = (uint16_t)tmr->CH4CC1;
    capture <<= 8;
    capture |= (uint16_t)tmr->CH4CC0;

    return capture;
}

/*!
 * @brief       Read specified Channel Compare/Capture register value
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       channel:    Timer Channel
 *                          The Parameter can be one of the following values:
 *                          @arg TMR1_CHANNEL_1:    Channel 1
 *                          @arg TMR1_CHANNEL_2:    Channel 2
 *                          @arg TMR1_CHANNEL_3:    Channel 3
 *                          @arg TMR1_CHANNEL_4:    Channel 4
 *
 * @retval      Capture Compare register value
 *
 * @note
 */
uint16_t TMR1_ReadCompareCapture(TMR1_T *tmr, TMR1_CHANNEL_T channel)
{
    if(channel & TMR1_CHANNEL_1)
    {
        return TMR1_ReadCapture1(tmr);
    }

    if(channel & TMR1_CHANNEL_2)
    {
        return TMR1_ReadCapture2(tmr);
    }

    else if(channel & TMR1_CHANNEL_3)
    {
        return TMR1_ReadCapture3(tmr);
    }

    else
    {
        return TMR1_ReadCapture4(tmr);
    }
}

/*!
 * @brief       Set specified Channel Input Capture divider
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       channel:    Timer Channel
 *                          The Parameter can be combination of the following values:
 *                          @arg TMR1_CHANNEL_1:    Channel 1
 *                          @arg TMR1_CHANNEL_2:    Channel 2
 *                          @arg TMR1_CHANNEL_3:    Channel 3
 *                          @arg TMR1_CHANNEL_4:    Channel 4
 *
 * @param       divider:    specifies the channel Input Capture divider
 *
 * @retval      None
 *
 * @note
 */
void TMR1_SetInputCaptureDivider(TMR1_T *tmr, uint8_t channel, TMR1_IC_DIV_T divider)
{
    if(channel & TMR1_CHANNEL_1)
    {
        tmr->CH1IC_B.IC1PSC = divider;
    }

    if(channel & TMR1_CHANNEL_2)
    {
        tmr->CH2IC_B.IC2PSC = divider;
    }

    if(channel & TMR1_CHANNEL_3)
    {
        tmr->CH3IC_B.IC3PSC = divider;
    }

