tieutuanbao/mcu_xlibs/arch/arm/geehy/apm32f003x4x6/libs/source/apm32f00x_tmr1.c
    if(channel & TMR1_CHANNEL_4)
    {
        tmr->CH4IC_B.IC4PSC = divider;
    }
}


/*!
 * @brief       Read counter register value
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      Counter register value
 *
 * @note
 */
uint16_t TMR1_ReadCounter(TMR1_T *tmr)
{
    uint16_t capture = 0;

    capture = (uint16_t)tmr->CNT1;
    capture <<= 8;
    capture |= (uint16_t)tmr->CNT0;

    return capture;
}

/*!
 * @brief       Read Divider register value
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      Divider register value
 *
 * @note
 */
uint16_t TMR1_ReadDivider(TMR1_T *tmr)
{
    uint16_t capture = 0;

    capture = (uint16_t)tmr->PSC1;
    capture <<= 8;
    capture |= (uint16_t)tmr->PSC0;

    return capture;
}

/*!
 * @brief       Read specifies the flag
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       flag:   specifies the flag
 *                      The parameter can be any combination of the following values:
 *                      @arg TMR1_FLAG_UPDATE:      update flag
 *                      @arg TMR1_FLAG_CH1CC:       Channel 1 Compare/Capture flag
 *                      @arg TMR1_FLAG_CH2CC:       Channel 2 Compare/Capture
 *                      @arg TMR1_FLAG_CH3CC:       Channel 3 Compare/Capture
 *                      @arg TMR1_FLAG_CH4CC:       Channel 4 Compare/Capture
 *                      @arg TMR1_FLAG_CC_UPDATE:   Compare/Capture Update flag
 *                      @arg TMR1_FLAG_TRIGGER:     Trigger flag
 *                      @arg TMR1_FLAG_BREAK:       Break flag
 *                      @arg TMR1_FLAG_CH1RCF:      Channel 1 repetition capture flag
 *                      @arg TMR1_FLAG_CH2RCF:      Channel 2 repetition capture flag
 *                      @arg TMR1_FLAG_CH3RCF:      Channel 3 repetition capture flag
 *                      @arg TMR1_FLAG_CH4RCF:      Channel 4 repetition capture flag
 *
 * @retval      specifies the flag status.It can be SET or RESET
 *
 * @note
 */
uint8_t TMR1_ReadStatusFlag(TMR1_T *tmr, uint16_t flag)
{
    uint8_t flag1;
    uint8_t flag2;
    uint8_t status1 = 0;
    uint8_t status2 = 0;

    flag1 = (uint8_t)(flag & 0XFF);
    flag2 = (uint8_t)((flag >> 8) & 0xff);

    if(flag1)
    {
        status1 = (uint8_t)(tmr->STS1 & flag1);
    }

    if(flag2)
    {
        status2 = (uint8_t)(tmr->STS2 & flag2);
    }

    if((flag1 == status1) && (flag2 == status2))
    {
        return SET;
    }

    return RESET;
}

/*!
 * @brief       Clear specifies the flag
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       flag:   specifies the flag
 *                      The parameter can be any combination of the following values:
 *                      @arg TMR1_FLAG_UPDATE:      update flag
 *                      @arg TMR1_FLAG_CH1CC:       Channel 1 Compare/Capture flag
 *                      @arg TMR1_FLAG_CH2CC:       Channel 2 Compare/Capture
 *                      @arg TMR1_FLAG_CH3CC:       Channel 3 Compare/Capture
 *                      @arg TMR1_FLAG_CH4CC:       Channel 4 Compare/Capture
 *                      @arg TMR1_FLAG_CC_UPDATE:   Compare/Capture Update flag
 *                      @arg TMR1_FLAG_TRIGGER:     Trigger flag
 *                      @arg TMR1_FLAG_BREAK:       Break flag
 *                      @arg TMR1_FLAG_CH1RCF:      Channel 1 repetition capture flag
 *                      @arg TMR1_FLAG_CH2RCF:      Channel 2 repetition capture flag
 *                      @arg TMR1_FLAG_CH3RCF:      Channel 3 repetition capture flag
 *                      @arg TMR1_FLAG_CH4RCF:      Channel 4 repetition capture flag
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ClearStatusFlag(TMR1_T *tmr, uint16_t flag)
{
    uint8_t flag1;
    uint8_t flag2;

    flag1 = (uint8_t)(flag & 0XFF);
    flag2 = (uint8_t)((flag >> 8) & 0xff);

    if(flag1)
    {
        tmr->STS1 &= (uint32_t)~flag1;
    }

    if(flag2)
    {
        tmr->STS2 &= (uint32_t)~flag2;
    }
}

/*!
 * @brief       Read interrupt flag
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       interrupt:  Interrupt source.
 *                          This parameter can be any combination of the following values:
 *                          @arg TMR1_INT_UPDATE:   Update interrupt
 *                          @arg TMR1_INT_CH1CC:    Channel 1 Compare/Capture interrupt
 *                          @arg TMR1_INT_CH2CC:    Channel 2 Compare/Capture interrupt
 *                          @arg TMR1_INT_CH3CC:    Channel 3 Compare/Capture interrupt
 *                          @arg TMR1_INT_CH4CC:    Channel 4 Compare/Capture interrupt
 *                          @arg TMR1_INT_CC_UPDATE:Compare/Capture Update interrupt
 *                          @arg TMR1_INT_TRIGGER:  Trigger interrupt
 *                          @arg TMR1_INT_BREAK:    Break interrupt
 *
 * @retval      Specifies Interrupt source flag status.It Can be SET or RESET
 *
 * @note
 */
uint8_t TMR1_ReadIntFlag(TMR1_T *tmr, uint8_t interrupt)
{
    uint8_t intEnable;
    uint8_t intStatus;

    intStatus = (uint8_t)(tmr->STS1 & interrupt);
    intEnable = (uint8_t)(tmr->INTCTRL & interrupt);

    if((intStatus == interrupt) && (intEnable == interrupt))
    {
        return SET;
    }

    return RESET;
}

/*!
 * @brief       Clear interrupt flag
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       interrupt:  Interrupt source.
 *                          This parameter can be any combination of the following values:
 *                          @arg TMR1_INT_UPDATE:   Update interrupt
 *                          @arg TMR1_INT_CH1CC:    Channel 1 Compare/Capture interrupt
 *                          @arg TMR1_INT_CH2CC:    Channel 2 Compare/Capture interrupt
 *                          @arg TMR1_INT_CH3CC:    Channel 3 Compare/Capture interrupt
 *                          @arg TMR1_INT_CH4CC:    Channel 4 Compare/Capture interrupt
 *                          @arg TMR1_INT_CC_UPDATE:Compare/Capture Update interrupt
 *                          @arg TMR1_INT_TRIGGER:  Trigger interrupt
 *                          @arg TMR1_INT_BREAK:    Break interrupt
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ClearIntFlag(TMR1_T *tmr, uint8_t interrupt)
{
    tmr->STS1 &= (uint32_t)~interrupt;
}

/*!
 * @brief       Slave mode Configuration
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       mode:   Specifies the slave mode
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigSlaveMode(TMR1_T *tmr, TMR1_SLAVE_MODE_T mode)
{
    tmr->SMC_B.SMFC = mode;
}

/*!
 * @brief       Master mode Configuration
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       mode:   Specifies the master mode
 *
 * @retval      None
 *
 * @note
 */
void TMR1_ConfigMasterMode(TMR1_T *tmr, TMR1_MASTER_MODE_T mode)
{
    tmr->CTRL2_B.MMFC = mode;
}

/*!
 * @brief       Enable master mode
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      None
 *
 * @note
 */
void TMR1_EnableMasterMode(TMR1_T *tmr)
{
    tmr->SMC_B.MSMEN = BIT_SET;
}

/*!
 * @brief       Disable master mode
 *
 * @param       tmr:    Timer peripheral. It can be TMR1 or TMR1A
 *
 * @retval      None
 *
 * @note
 */
void TMR1_DisableMasterMode(TMR1_T *tmr)
{
    tmr->SMC_B.MSMEN = BIT_RESET;
}

/**@} end of group TMR1_Fuctions*/
/**@} end of group TMR1_Driver */
/**@} end of group Peripherals_Library*/
